
var numstr=new Array();
numstr[0]='08.20.32.44.'; //鼠
numstr[1]='07.19.31.43.'; //牛
numstr[2]='06.18.30.42.'; //虎
numstr[3]='05.17.29.41.'; //兔
numstr[4]='04.16.28.40.'; //龙
numstr[5]='03.15.27.39.'; //蛇
numstr[6]='02.14.26.38.'; //马
numstr[7]='01.13.25.37.49.'; //羊
numstr[8]='12.24.36.48.'; //猴
numstr[9]='11.23.35.47.'; //鸡
numstr[10]='10.22.34.46.'; //狗
numstr[11]='09.21.33.45.'; //猪
numstr[12]="01.02.07.08.12.13.18.19.23.24.29.30.34.35.40.45.46.";//红波
numstr[13]="03.04.09.10.14.15.20.25.26.31.36.37.41.42.47.48.";//蓝波
numstr[14]="05.06.11.16.17.21.22.27.28.32.33.38.39.43.44.49.";//绿波
numstr[15]="01.03.05.07.09.10.12.14.16.18.21.23.25.27.29.30.32.34.36.38.41.43.45.47.";//合单
numstr[16]="02.04.06.08.11.13.15.17.19.20.22.24.26.28.31.33.35.37.39.40.42.44.46.48.";//合双
numstr[17]="25.26.27.28.29.30.31.32.33.34.35.36.37.38.39.40.41.42.43.44.45.46.47.48.";//大
numstr[18]="01.02.03.04.05.06.07.08.09.10.11.12.13.14.15.16.17.18.19.20.21.22.23.24.";//小
numstr[19]="01.03.05.07.09.11.13.15.17.19.21.23.25.27.29.31.33.35.37.39.41.43.45.47.";//单
numstr[20]="02.04.06.08.10.12.14.16.18.20.22.24.26.28.30.32.34.36.38.40.42.44.46.48.";//双
numstr[21]="07.08.09.16.17.18.19.25.26.27.28.29.34.35.36.37.38.39.43.44.45.46.47.48.";//合大
numstr[22]="01.02.03.04.05.06.10.11.12.13.14.15.20.21.22.23.24.30.31.32.33.40.41.42.";//合小
numstr[23]="01.07.13.19.23.29.35.45.";//红单
numstr[24]="02.08.12.18.24.30.34.40.46.";//红双
numstr[25]="29.30.34.35.40.45.46.";//红大
numstr[26]="01.02.07.08.12.13.18.19.23.24.";//红小
numstr[27]="03.09.15.25.31.37.41.47.";//蓝单
numstr[28]="04.10.14.20.26.36.42.48.";//蓝双
numstr[29]="25.26.31.36.37.41.42.47.48.";//蓝大
numstr[30]="03.04.09.10.14.15.20.";//蓝小
numstr[31]="05.11.17.21.27.33.39.43.49.";//绿单
numstr[32]="06.16.22.28.32.38.44.";//绿双
numstr[33]="27.28.32.33.38.39.43.44.49.";//绿大
numstr[34]="05.06.11.16.17.21.22.";//绿小
numstr[35]="01.02.03.04.05.06.07.08.09.";//0头
numstr[36]="10.11.12.13.14.15.16.17.18.19.";//1头
numstr[37]="20.21.22.23.24.25.26.27.28.29.";//2头
numstr[38]="30.31.32.33.34.35.36.37.38.39.";//3头
numstr[39]="40.41.42.43.44.45.46.47.48.49.";//4头
numstr[40]="10.20.30.40.";//0尾
numstr[41]="01.11.21.31.41.";//1尾
numstr[42]="02.12.22.32.42.";//2尾
numstr[43]="03.13.23.33.43.";//3尾
numstr[44]="04.14.24.34.44.";//4尾
numstr[45]="05.15.25.35.45.";//5尾
numstr[46]="06.16.26.36.46.";//6尾
numstr[47]="07.17.27.37.47.";//7尾
numstr[48]="08.18.28.38.48.";//8尾
numstr[49]="09.19.29.39.49.";//9尾
numstr[50]="25.27.29.31.33.35.37.39.41.43.45.47.";//大单
numstr[51]="26.28.30.32.34.36.38.40.42.44.46.48.";//大双
numstr[52]="01.03.05.07.09.11.13.15.17.19.21.23.";//小单
numstr[53]="02.04.06.08.10.12.14.16.18.20.22.24.";//小双
numstr[54]=numstr[1]+numstr[6]+numstr[7]+numstr[9]+numstr[10]+numstr[11];//家禽
numstr[55]=numstr[0]+numstr[2]+numstr[3]+numstr[4]+numstr[5]+numstr[8]//野兽
numstr[56]="29.35.45.";//红单大
numstr[57]="01.07.13.19.23.";//红单小
numstr[58]="30.34.40.46.";//红双大
numstr[59]="02.08.12.18.24.";//红双小
numstr[60]="25.31.37.41.47.";//蓝单大
numstr[61]="03.09.15.";//蓝单小
numstr[62]="26.36.42.48.";//蓝双大
numstr[63]="04.10.14.20.";//蓝双小
numstr[64]="27.33.39.43.49.";//绿单大
numstr[65]="05.11.17.21.";//绿单小
numstr[66]="28.32.38.44.";//绿双大
numstr[67]="06.16.22.";//绿双小

function quick_select(num,tdobj)
{
	var v=$("#txtrmb").val();
	if(v == "" || v == "0"){
		alert('請先輸入金額！');$("#txtrmb").focus();
		return;
	}
	var words = numstr[num].split('.');
	if(!$(tdobj).hasClass("t15_sel"))
	{//选择号码
		for(i=0;i<words.length-1;i++)
		{
			nums=parseFloat(words[i])<10?"0"+parseFloat(words[i]):words[i];
			if($("#check").val().indexOf(words[i]+",")==-1)
			{
				$("#check").val($("#check").val()+nums+",");
				$("#hm"+nums).addClass("ball_sel");
			}
		}
		$(tdobj).addClass("t15_sel");
	}else
	{//取消选择号码
		for(i=0;i<words.length-1;i++)
		{
			nums=parseFloat(words[i])<10?"0"+parseFloat(words[i]):words[i];
			$("#check").val($("#check").val().replace(nums+",",""));
			$("#hm"+nums).removeClass("ball_sel");
		}
		$(tdobj).removeClass("t15_sel");
	}
sendMoney();
}
function clear_select()
{
	for(i=1;i<50;i++)
	{
		if(i<10)
			$("#hm0"+i).removeClass("ball_sel");
		else
			$("#hm"+i).removeClass("ball_sel");
	}
	$('#FastPanel td').removeClass('t15_sel');
	$("input[type=text][name^='Num_']").attr("value","");
	$("#check").val("");
	RefTotal();
}

//填写下注金额
function sendMoney(){
	//初始化所有金额
	var input_out = $("input[name^='Num_']");
	var h=0;
	for (h;h<input_out.length;h++) {
		$(input_out[h]).val('');
	};

	var num=$("#check").val().split(',');//已选号码
	var v=$("#txtrmb").val();//下注金额
	
	if(v!=""){	

		for(var i=0;i<num.length;i++)
		{
			if(num<10)
				$("#Num_0"+num[i]).val(v)
			else
				$("#Num_"+num[i]).val(v)
		}	
		RefTotal();
	}
	else{
		alert('請輸入金額！');$("#txtrmb").focus();
	}
}

//修改下注总金额
function RefTotal(){
	var total=0;
	$.each($("input[name^='Num_']"),function(index,v){
		if(v.value!="") total+=parseFloat(v.value);
	});
	$("#allgold").text(total);
}